
* llarp high level design document                         :llarp:docs:loki:
  CLOCK: [2018-05-14 Mon 09:30]--[2018-05-14 Mon 10:52] =>  1:22

* i2pd test network bandwidth profiling :i2pd:loki:
  CLOCK: [2018-05-14 Mon 12:30]--[2018-05-14 Mon 13:38] =>  1:08
  CLOCK: [2018-05-14 Mon 11:04]--[2018-05-14 Mon 12:08] =>  1:04
  

* i2pd loki network dirauth design                                :i2pd:loki:
** i2pd loki network dirauth threat model                     :i2pd:javai2p:loki:
** i2pd peer bw or peer profile i2np message                          :i2pd:loki:
*** i2pd i2np extension messages                              :i2pd:i2npext:loki:
    CLOCK: [2018-05-15 Tue 11:33]--[2018-05-15 Tue 14:34] =>  3:01
    CLOCK: [2018-05-15 Tue 09:43]--[2018-05-15 Tue 10:23] =>  0:40
    
    
** lokid providing authortitative network concesous                   :i2pd:loki:

* network congestion metric for proof of work function :i2pd:java-i2p:loki:



* think about
** exit nodes
** guard nodes
   
* get llarp to do something
  CLOCK: [2018-05-29 Tue 09:13]--[2018-05-29 Tue 09:46] =>  0:33
  CLOCK: [2018-05-29 Tue 06:59]--[2018-05-29 Tue 08:27] =>  1:28
  CLOCK: [2018-05-28 Mon 12:53]--[2018-05-28 Mon 17:14] =>  4:21
  CLOCK: [2018-05-28 Mon 08:28]--[2018-05-28 Mon 10:45] =>  2:17
  CLOCK: [2018-05-27 Sun 11:34]--[2018-05-27 Sun 16:04] =>  4:30
  CLOCK: [2018-05-27 Sun 10:07]--[2018-05-27 Sun 10:24] =>  0:17
  CLOCK: [2018-05-27 Sun 08:23]--[2018-05-27 Sun 10:05] =>  1:42
  CLOCK: [2018-05-26 Sat 12:35]--[2018-05-26 Sat 14:44] =>  2:09
  CLOCK: [2018-05-26 Sat 11:50]--[2018-05-26 Sat 12:10] =>  0:20
  CLOCK: [2018-05-25 Fri 08:26]--[2018-05-25 Fri 13:53] =>  5:27
  CLOCK: [2018-05-24 Thu 10:33]--[2018-05-24 Thu 12:16] =>  1:43
  CLOCK: [2018-05-24 Thu 08:59]--[2018-05-24 Thu 10:03] =>  1:04
  CLOCK: [2018-05-23 Wed 12:14]--[2018-05-23 Wed 16:46] =>  4:32
  CLOCK: [2018-05-23 Wed 11:04]--[2018-05-23 Wed 11:29] =>  0:25
  CLOCK: [2018-05-23 Wed 08:12]--[2018-05-23 Wed 11:04] =>  2:52
  CLOCK: [2018-05-22 Tue 14:26]--[2018-05-22 Tue 15:23] =>  0:57
  CLOCK: [2018-05-22 Tue 11:34]--[2018-05-22 Tue 12:13] =>  0:39
  CLOCK: [2018-05-22 Tue 08:48]--[2018-05-22 Tue 11:00] =>  2:12
  CLOCK: [2018-05-21 Mon 15:32]--[2018-05-21 Mon 19:42] =>  4:10
  CLOCK: [2018-05-21 Mon 14:55]--[2018-05-21 Mon 15:05] =>  0:10
  CLOCK: [2018-05-21 Mon 11:45]--[2018-05-21 Mon 13:51] =>  2:06
  CLOCK: [2018-05-21 Mon 10:52]--[2018-05-21 Mon 11:22] =>  0:30
  CLOCK: [2018-05-21 Mon 10:46]--[2018-05-21 Mon 10:52] =>  0:06
  CLOCK: [2018-05-21 Mon 08:42]--[2018-05-21 Mon 10:46] =>  2:04
  CLOCK: [2018-05-20 Sun 14:16]--[2018-05-20 Sun 15:40] =>  1:24
  CLOCK: [2018-05-20 Sun 12:00]--[2018-05-20 Sun 14:00] =>  2:00
  CLOCK: [2018-05-20 Sun 10:46]--[2018-05-20 Sun 11:41] =>  0:55
  CLOCK: [2018-05-20 Sun 08:49]--[2018-05-20 Sun 09:47] =>  0:58
  CLOCK: [2018-05-19 Sat 10:41]--[2018-05-19 Sat 13:22] =>  2:41
  CLOCK: [2018-05-19 Sat 09:02]--[2018-05-19 Sat 10:10] =>  1:08
  CLOCK: [2018-05-18 Fri 14:50]--[2018-05-18 Fri 16:09] =>  1:19
  CLOCK: [2018-05-18 Fri 11:39]--[2018-05-18 Fri 14:30] =>  2:51
  CLOCK: [2018-05-18 Fri 08:04]--[2018-05-18 Fri 11:08] =>  3:04

  CLOCK: [2018-05-17 Thu 15:33]--[2018-05-17 Thu 16:04] =>  0:31
  CLOCK: [2018-05-16 Wed 13:04]--[2018-05-16 Wed 14:18] =>  1:14

  CLOCK: [2018-05-16 Wed 11:11]--[2018-05-16 Wed 12:55] =>  1:44
  CLOCK: [2018-05-16 Wed 09:29]--[2018-05-16 Wed 10:48] =>  1:19


  


* backport llarp to xenial
  CLOCK: [2018-05-29 Tue 09:47]--[2018-05-29 Tue 12:19] =>  2:32

* implement llarp router db
  CLOCK: [2018-05-29 Tue 13:39]--[2018-05-29 Tue 16:17] =>  2:38

 
* revamp dht spec
  CLOCK: [2018-05-31 Thu 10:37]--[2018-05-31 Thu 12:45] =>  2:08
  CLOCK: [2018-05-31 Thu 08:11]--[2018-05-31 Thu 10:12] =>  2:01
  CLOCK: [2018-05-30 Wed 12:15]--[2018-05-30 Wed 12:59] =>  0:44
  CLOCK: [2018-05-30 Wed 09:26]--[2018-05-30 Wed 12:03] =>  2:37

* implement dht

  CLOCK: [2018-06-01 Fri 12:30]--[2018-06-01 Fri 18:00] =>  5:30
  CLOCK: [2018-06-01 Fri 10:52]--[2018-06-01 Fri 11:58] =>  1:06
  CLOCK: [2018-06-01 Fri 07:48]--[2018-06-01 Fri 10:30] =>  2:42
  CLOCK: [2018-05-31 Thu 17:38]--[2018-05-31 Thu 17:53] =>  0:15
 

* test network
  CLOCK: [2018-06-07 Thu 11:00]--[2018-06-07 Thu 15:32] =>  4:32
  CLOCK: [2018-06-07 Thu 08:17]--[2018-06-07 Thu 10:24] =>  2:07

